status/2021/30apr21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>24 April 2021 - 30 April 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">24 April 2021 - 30 April 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50d7c93">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#orgdbb14c4">1.1. Next step</a>
<ul>
<li><a href="#org6f4fa42">1.1.1. Check replacement sensor</a></li>
<li><a href="#org5fc3f36">1.1.2. Clean BME680/VELM6075 boards</a></li>
<li><a href="#org56e0a53">1.1.3. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge02ba73">2. EPICS</a>
<ul>
<li><a href="#org9e5cdf6">2.1. Next steps</a>
<ul>
<li><a href="#orgc0d7410">2.1.1. u3scpi network port testing</a></li>
<li><a href="#org9bf7d94">2.1.2. initial EPICS interface</a></li>
<li><a href="#org4045e24">2.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org611cf03">3. Brini Tracker II</a>
<ul>
<li><a href="#org95db3ce">3.1. Next steps</a>
<ul>
<li><a href="#org1ea9cf7">3.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org11fd798">3.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org0882cc9">3.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org336296b">4. wktcolor</a>
<ul>
<li><a href="#orgee004df">4.1. Added ColPack coloring interface</a></li>
<li><a href="#orgef99ab3">4.2. Fedora 34 changes</a></li>
<li><a href="#org3223bfd">4.3. Next steps</a>
<ul>
<li><a href="#org7c78826">4.3.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org547510e">5. wktplot</a>
<ul>
<li><a href="#orgcd9402e">5.1. Fedora 34 changes</a></li>
<li><a href="#org81a5012">5.2. Next steps</a></li>
</ul>
</li>
<li><a href="#org2de4529">6. ca-r</a>
<ul>
<li><a href="#org62b645a">6.1. Seems to have survived Fedora 34 update</a></li>
<li><a href="#orgf47fb8a">6.2. Next Step</a></li>
</ul>
</li>
<li><a href="#org1e09313">7. GMP Forth</a>
<ul>
<li><a href="#org65b9e0d">7.1. minor Ruby 3.0 changes</a></li>
</ul>
</li>
<li><a href="#org7e1dd62">8. AMDGPU</a>
<ul>
<li><a href="#orgaa37eed">8.1. Next step</a>
<ul>
<li><a href="#org2f15563">8.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4599bb6">9. Ninja v Make</a>
<ul>
<li><a href="#org471caca">9.1. Next Step</a>
<ul>
<li><a href="#org0262f61">9.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf1f8bab">10. Fedora 34 update</a>
<ul>
<li><a href="#orgee0aab0">10.1. Went mostly well</a>
<ul>
<li><a href="#org2e26021">10.1.1. TMUX mouse interface UI changed - need shift key for mouse</a></li>
<li><a href="#orgb560f9b">10.1.2. copy/paste Firefox tended to hang when following links.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf33657a">11. Linux Audio</a>
<ul>
<li><a href="#orgfca83ee">11.1. Next Steps</a>
<ul>
<li><a href="#org9decc51">11.1.1. MIDI interfaces</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd65d5ca">12. Conical Rolling Pin</a></li>
</ul>
</div>
</div>
<p>
Another Birthday gone by
</p>

<div id="outline-container-org50d7c93" class="outline-2">
<h2 id="org50d7c93"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Replacement Plantower sensor acquired
</p>
</div>
<div id="outline-container-orgdbb14c4" class="outline-3">
<h3 id="orgdbb14c4"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6f4fa42" class="outline-4">
<h4 id="org6f4fa42"><span class="section-number-4">1.1.1.</span> Check replacement sensor</h4>
</div>
<div id="outline-container-org5fc3f36" class="outline-4">
<h4 id="org5fc3f36"><span class="section-number-4">1.1.2.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-org56e0a53" class="outline-4">
<h4 id="org56e0a53"><span class="section-number-4">1.1.3.</span> Design more robust instrument shelter</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Use existing small mast for VEML6075; put others in larger shelter.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge02ba73" class="outline-2">
<h2 id="orge02ba73"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
No progress. Now that the Brini Tracker A/D is working (which was
the original motivation for getting U3 stuff working), this is no
longer "critical path" - not like anything is critical in this list.
</p>
</div>
<div id="outline-container-org9e5cdf6" class="outline-3">
<h3 id="org9e5cdf6"><span class="section-number-3">2.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc0d7410" class="outline-4">
<h4 id="orgc0d7410"><span class="section-number-4">2.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org9bf7d94" class="outline-4">
<h4 id="org9bf7d94"><span class="section-number-4">2.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org4045e24" class="outline-4">
<h4 id="org4045e24"><span class="section-number-4">2.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>
<div id="outline-container-org611cf03" class="outline-2">
<h2 id="org611cf03"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
No progress
</p>
</div>
<div id="outline-container-org95db3ce" class="outline-3">
<h3 id="org95db3ce"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org1ea9cf7" class="outline-4">
<h4 id="org1ea9cf7"><span class="section-number-4">3.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org11fd798" class="outline-4">
<h4 id="org11fd798"><span class="section-number-4">3.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org0882cc9" class="outline-4">
<h4 id="org0882cc9"><span class="section-number-4">3.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>
<div id="outline-container-org336296b" class="outline-2">
<h2 id="org336296b"><span class="section-number-2">4.</span> wktcolor</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgee004df" class="outline-3">
<h3 id="orgee004df"><span class="section-number-3">4.1.</span> Added ColPack coloring interface</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Somewhat better, but not quite there
</p>
</div>
</div>
<div id="outline-container-orgef99ab3" class="outline-3">
<h3 id="orgef99ab3"><span class="section-number-3">4.2.</span> Fedora 34 changes</h3>
</div>
<div id="outline-container-org3223bfd" class="outline-3">
<h3 id="org3223bfd"><span class="section-number-3">4.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org7c78826" class="outline-4">
<h4 id="org7c78826"><span class="section-number-4">4.3.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org547510e" class="outline-2">
<h2 id="org547510e"><span class="section-number-2">5.</span> wktplot</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgcd9402e" class="outline-3">
<h3 id="orgcd9402e"><span class="section-number-3">5.1.</span> Fedora 34 changes</h3>
</div>
<div id="outline-container-org81a5012" class="outline-3">
<h3 id="org81a5012"><span class="section-number-3">5.2.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>
<div id="outline-container-org2de4529" class="outline-2">
<h2 id="org2de4529"><span class="section-number-2">6.</span> ca-r</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org62b645a" class="outline-3">
<h3 id="org62b645a"><span class="section-number-3">6.1.</span> Seems to have survived Fedora 34 update</h3>
</div>
<div id="outline-container-orgf47fb8a" class="outline-3">
<h3 id="orgf47fb8a"><span class="section-number-3">6.2.</span> Next Step</h3>
<div class="outline-text-3" id="text-6-2">
<p>
None
</p>
</div>
</div>
</div>
<div id="outline-container-org1e09313" class="outline-2">
<h2 id="org1e09313"><span class="section-number-2">7.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org65b9e0d" class="outline-3">
<h3 id="org65b9e0d"><span class="section-number-3">7.1.</span> minor Ruby 3.0 changes</h3>
</div>
</div>
<div id="outline-container-org7e1dd62" class="outline-2">
<h2 id="org7e1dd62"><span class="section-number-2">8.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgaa37eed" class="outline-3">
<h3 id="orgaa37eed"><span class="section-number-3">8.1.</span> Next step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org2f15563" class="outline-4">
<h4 id="org2f15563"><span class="section-number-4">8.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>
<div id="outline-container-org4599bb6" class="outline-2">
<h2 id="org4599bb6"><span class="section-number-2">9.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org471caca" class="outline-3">
<h3 id="org471caca"><span class="section-number-3">9.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org0262f61" class="outline-4">
<h4 id="org0262f61"><span class="section-number-4">9.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>
<div id="outline-container-orgf1f8bab" class="outline-2">
<h2 id="orgf1f8bab"><span class="section-number-2">10.</span> Fedora 34 update</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgee0aab0" class="outline-3">
<h3 id="orgee0aab0"><span class="section-number-3">10.1.</span> Went mostly well</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org2e26021" class="outline-4">
<h4 id="org2e26021"><span class="section-number-4">10.1.1.</span> TMUX mouse interface UI changed - need shift key for mouse</h4>
</div>
<div id="outline-container-orgb560f9b" class="outline-4">
<h4 id="orgb560f9b"><span class="section-number-4">10.1.2.</span> copy/paste Firefox tended to hang when following links.</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
Turning off IPv6 seems to help, but still happens. Difficult to
characterize.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf33657a" class="outline-2">
<h2 id="orgf33657a"><span class="section-number-2">11.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-11">
<p>
Fedora 34 now uses PipeWire for audio, which integrates (among other
things) a JACK server interface. Refreshed all of the various audio
programs I use (snd, pd, faust, Carla) and all were made to work.
Snd still have some problems with setting the real-time priority of
the play thread.
</p>
</div>
<div id="outline-container-orgfca83ee" class="outline-3">
<h3 id="orgfca83ee"><span class="section-number-3">11.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-org9decc51" class="outline-4">
<h4 id="org9decc51"><span class="section-number-4">11.1.1.</span> MIDI interfaces</h4>
</div>
</div>
</div>
<div id="outline-container-orgd65d5ca" class="outline-2">
<h2 id="orgd65d5ca"><span class="section-number-2">12.</span> Conical Rolling Pin</h2>
<div class="outline-text-2" id="text-12">
<p>
Made a prototype conical rolling pin to facilitate rolling out pizza
dough in the cast iron pizza pan. Yes, I know rolling out pizza dough
is "not how you do it". Fine. Fire me. You don't have to eat my pizza.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>